spec/cassettes/coinbase/wallet_with_zero_balance.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.coinbase.com/v2/accounts/test-wallet-id
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - coinbase/ruby/4.1.0
      Content-Type:
      - application/json
      Cb-Access-Key:
      - COINBASE_API_KEY
      Cb-Access-Sign:
      - bba72e8d26c68be299de97457509de5e662f301a93cf4d82d74cb1aee55d6300
      Cb-Access-Timestamp:
      - '1490792235'
      Cb-Version:
      - '2015-06-16'
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 29 Mar 2017 12:57:16 GMT
      Content-Type:
      - application/json; charset=utf-8
      Content-Length:
      - '231'
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=dcd020e7c4bfabd17dc293d31c14852921490792235; expires=Thu, 29-Mar-18
        12:57:15 GMT; path=/; domain=.coinbase.com; HttpOnly
      - _coinbase=RzFUaHJ0NmhPNDEzYmZpWWtBQWRTOUovWFdvQUZ1WXNHRGtZTnZ3bzJYV3hRRG5jMDlGY0lKeTJjUTVDUXM5bFdhaTVaeTZya01BeTNmVjdEZlBXMjFhcVZMRmZmaVUrVEpGQWx6MW5qTVE1OUE2L1A1aFNJK0NsaDRtaG11YXJLSS93UnVRT0JzM0VOblRVMUdtRjFnPT0tLXRYUDFWVlk3UUxpMXM4Q0ZlN1BOL3c9PQ%3D%3D--1caa92526b686a3d6c73b0c86fbf350e6de90800;
        path=/; secure; HttpOnly
      Cache-Control:
      - private, no-cache, no-store, must-revalidate
      Content-Disposition:
      - attachment; filename=response.json
      Content-Security-Policy:
      - 'default-src ''self'' https://www.coinbase.com; child-src ''self'' https://www.coinbase.com
        https://*.olark.com https://*.online-metrix.net https://*.wpstn.com https://netverify.com
        https://platform.twitter.com https://www.google.com/recaptcha/ blob:; connect-src
        ''self'' https://www.coinbase.com https://api.coinbase.com https://api.mixpanel.com
        https://*.online-metrix.net https://api.cloudinary.com https://*.olark.com
        static.coinbase.com wss://ws.coinbase.com wss://ws.coinbase.com:443; font-src
        ''self'' https://www.coinbase.com static.coinbase.com; img-src ''self'' data:
        https://www.coinbase.com https://images.coinbase.com https://exceptions.coinbase.com
        https://coinbase-uploads.s3.amazonaws.com https://maps.gstatic.com https://ssl.google-analytics.com
        https://www.google.com https://maps.googleapis.com https://csi.gstatic.com
        https://www.google-analytics.com https://*.olark.com https://res.cloudinary.com
        https://secure.gravatar.com https://i2.wp.com https://*.online-metrix.net
        https://hexagon-analytics.com https://api.mixpanel.com blob: static.coinbase.com
        https://www.facebook.com/tr; media-src ''self'' https://www.coinbase.com https://*.olark.com
        blob:; object-src ''self'' data: https://www.coinbase.com https://cdn.siftscience.com
        https://*.online-metrix.net https://www.gstatic.com https://www.google.com/recaptcha/api/;
        script-src ''self'' ''unsafe-inline'' ''unsafe-eval'' https://www.coinbase.com
        https://*.olark.com https://cdn.siftscience.com https://*.newrelic.com https://bam.nr-data.net
        https://*.google-analytics.com https://www.google.com https://www.gstatic.com
        https://*.online-metrix.net https://code.jquery.com https://chart.googleapis.com
        https://maps.googleapis.com https://maps.gstatic.com https://netverify.com
        https://ajax.cloudflare.com static.coinbase.com; style-src ''self'' ''unsafe-inline''
        https://www.coinbase.com https://static.olark.com static.coinbase.com; report-uri
        /csp-report'
      Etag:
      - W/"7b3fa22c7e8ce964ca9d686f6e66288d"
      Expires:
      - Sat, 01 Jan 2000 00:00:00 GMT
      Pragma:
      - no-cache
      Public-Key-Pins:
      - max-age=5184000; pin-sha256="r/mIkG3eEpVdm+u/ko/cwxzOMo1bk4TyHIlByibiA5E=";
        pin-sha256="WoiWRyIOVNa9ihaBciRSC7XHjliYS9VwUGOIud4PB18="; pin-sha256="JbQbUG5JMJUoI6brnx0x3vZF6jilxsapbXGVfjhN8Fg="
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains; preload
      Vary:
      - Origin,Accept-Encoding
      X-Content-Type-Options:
      - nosniff
      X-Download-Options:
      - noopen
      X-Frame-Options:
      - DENY
      X-Permitted-Cross-Domain-Policies:
      - none
      X-Powered-By:
      - Proof-of-Work
      X-Request-Id:
      - 7e3708de-4b59-4897-95ce-855903d0370a
      X-Xss-Protection:
      - 1; mode=block
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 3472fe72b8f8595a-VIE
    body:
      encoding: ASCII-8BIT
      string: '{"data":{"id":"test-wallet-id","name":"test-wallet","primary":false,"type":"wallet","currency":"BTC","balance":{"amount":"0.00000000","currency":"BTC"},"native_balance":{"amount":"0.00","currency":"USD"},"created_at":"2017-03-29T12:57:15Z","updated_at":"2017-03-29T12:57:16Z","resource":"account","resource_path":"/v2/accounts/test-wallet-id"}}'
    http_version:
  recorded_at: Wed, 29 Mar 2017 12:57:16 GMT
